# 1 Comprension y Limpieza de los datos

In [12]:
#### Cargar paquetes siempre al inicio

from platform import python_version
import pandas as pd ### para manejo de datos
import sqlite3 as sql

In [13]:
python_version() ### verificar version de python

'3.10.2'

In [48]:
### Cargar tablas de datos desde github ###

action='https://raw.githubusercontent.com/juancamiloespana/aplicacionesanalitica/main/data/tbl_Action.csv'
employees= 'https://raw.githubusercontent.com/juancamiloespana/aplicacionesanalitica/main/data/tbl_Employee.csv'
performance='https://raw.githubusercontent.com/juancamiloespana/aplicacionesanalitica/main/data/tbl_Perf.csv'

df_action=pd.read_csv(action)
df_employees=pd.read_csv(employees)
df_performance=pd.read_csv(performance)

## Verificar contenido de tablas

In [50]:

df_action.sort_values(by=['EffectiveDt'],ascending=0).head(10)

      ActID  ActionID  EmpID  EffectiveDt
1387   1388        10   1207  31/Oct/2017
1025   1026        90    958  31/Oct/2015
1656   1657        90    387  31/May/2020
1514   1515        91    275  31/May/2019
1378   1379        10   1202  31/May/2018
67       68        10     68  31/May/2016
1070   1071        10   1041  31/May/2015
1819   1820        10   1423  31/Mar/2022
1768   1769        90    588  31/Mar/2021
2464   2465        30    106  31/Mar/2020

In [43]:
df_employees.sort_values(by=['EngDt'],ascending=0).head(10)

,EmpID,EmpName,EngDt,TermDt,DepID,GenderID,RaceID,MgrID,DOB,PayRate,Level
404,405,"MacMillan, Harry H",31/12/2016,NaN,2,0,4,398,27/Feb/1981,NaN,7
346,347,"Gibbs, Gary P",31/12/2016,05/Jun/2022,4,0,4,332,24/Apr/1988,NaN,8
1206,1207,"Wright, Irene I",31/10/2017,22/Jan/2022,9,1,1,1147,25/Jan/1967,NaN,18
1235,1236,"Bennett, Diane B",31/08/2019,NaN,5,1,2,1131,31/Mar/1989,NaN,20
1433,1434,"Parrett, Gordon H",31/07/2022,NaN,4,0,1,1405,27/Apr/1964,NaN,26
1156,1157,"Pryde, Martin I",31/07/2017,08/Aug/2022,1,0,2,1120,16/Feb/1973,NaN,25
636,637,"Lloyd, Leonard S",31/07/2016,15/Jul/2017,4,0,5,626,26/Oct/1977,NaN,12
1038,1039,"Brant, Rebecca V",31/07/2015,NaN,6,1,5,1003,05/Sep/1964,NaN,20
245,246,"Goddard, Brenda X",31/07/2015,NaN,4,1,5,231,06/Sep/1949,NaN,6
1201,1202,"Rawson, Amanda V",31/05/2018,NaN,6,1,5,1196,15/Feb/1979,NaN,24

In [51]:
df_performance.sort_values(by=['PerfDate'],ascending=0).head(10)

      PerfID  EmpID  Rating     PerfDate
9604    9605   1562       2  31/Dec/2023
8861    8862    558       3  31/Dec/2023
8855    8856    550       3  31/Dec/2023
8856    8857    551       3  31/Dec/2023
8857    8858    552       3  31/Dec/2023
8858    8859    553       3  31/Dec/2023
8859    8860    554       3  31/Dec/2023
8860    8861    556       3  31/Dec/2023
8862    8863    559       3  31/Dec/2023
8870    8871    570       2  31/Dec/2023

In [56]:
#### crear base de datos ####

conn= sql.connect("db_empleados") ### crea una base de datos con el nombre dentro de comillas, si existe crea una conexión.

### Llevar tablas a base de datos

df_action.to_sql("action",conn,if_exists="replace")
df_employees.to_sql("employee",conn,if_exists="replace")
df_performance.to_sql("performance",conn,if_exists="replace")

9605

In [69]:
### convertir tabla de base de datos en data frame de pandas

read_df_action=pd.read_sql('select ActionID,count(*) from action group by ActionID', conn)
read_df_action

   ActionID  count(*)
0        10      1562
1        30       488
2        90       271
3        91       265

In [70]:
read_df_employee=pd.read_sql('select DepID,count(*) from employee group by DepID', conn)
read_df_employee

   DepID  count(*)
0      1       175
1      2       147
2      3       160
3      4       162
4      5       153
5      6       170
6      7       145
7      8       160
8      9       139
9     10       151

In [ ]:
read_df_employee=pd.read_sql('select DepID,count(*) from employee group by DepID', conn)
read_df_employee